## Terraform Plan for Staging Environment

**Environment**: Staging
**Branch**: develop
**Triggered by**: PR #2
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.database.aws_db_instance.database[0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "database" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = 20
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = 7
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = "03:00-04:00"
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m database_insights_mode                = (known after apply)
      [32m+[0m[0m db_name                               = "tfplayground"
      [32m+[0m[0m db_subnet_group_name                  = "staging-db-subnet-group"
      [32m+[0m[0m dedicated_log_volume                  = false
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m deletion_protection                   = false
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "mysql"
      [32m+[0m[0m engine_lifecycle_support              = (known after apply)
      [32m+[0m[0m engine_version                        = "8.0"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = "staging-db"
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.small"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = "mon:04:00-mon:05:00"
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = false
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = (known after apply)
      [32m+[0m[0m password                              = (sensitive value)
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = (known after apply)
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_encrypted                     = true
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = "gp3"
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "Name" = "staging-database"
        }
      [32m+[0m[0m tags_all                              = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-database"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = "tfplayground_user"
      [32m+[0m[0m vpc_security_group_ids                = (known after apply)
    }

[1m  # module.database.aws_db_subnet_group.database[0m will be created
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "database" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m description             = "Managed by Terraform"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m name                    = "staging-db-subnet-group"
      [32m+[0m[0m name_prefix             = (known after apply)
      [32m+[0m[0m subnet_ids              = (known after apply)
      [32m+[0m[0m supported_network_types = (known after apply)
      [32m+[0m[0m tags                    = {
          [32m+[0m[0m "Name" = "staging-db-subnet-group"
        }
      [32m+[0m[0m tags_all                = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-db-subnet-group"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id                  = (known after apply)
    }

[1m  # module.database.aws_security_group.database[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "database" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Security group for RDS instance"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = "Allow MySQL access from web server"
              [32m+[0m[0m from_port        = 3306
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = (known after apply)
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 3306
            },
        ]
      [32m+[0m[0m name                   = "staging-database-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name" = "staging-database-sg"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-database-sg"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.networking.aws_eip.nat[0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "nat" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = "vpc"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m ipam_pool_id         = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m ptr_record           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-nat-eip"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-nat-eip"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # module.networking.aws_internet_gateway.main[0m will be created
[0m  [32m+[0m[0m resource "aws_internet_gateway" "main" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m owner_id = (known after apply)
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-igw"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-igw"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id   = (known after apply)
    }

[1m  # module.networking.aws_nat_gateway.main[0m will be created
[0m  [32m+[0m[0m resource "aws_nat_gateway" "main" {
      [32m+[0m[0m allocation_id                      = (known after apply)
      [32m+[0m[0m association_id                     = (known after apply)
      [32m+[0m[0m connectivity_type                  = "public"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m network_interface_id               = (known after apply)
      [32m+[0m[0m private_ip                         = (known after apply)
      [32m+[0m[0m public_ip                          = (known after apply)
      [32m+[0m[0m secondary_private_ip_address_count = (known after apply)
      [32m+[0m[0m secondary_private_ip_addresses     = (known after apply)
      [32m+[0m[0m subnet_id                          = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-nat"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-nat"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
    }

[1m  # module.networking.aws_route_table.private[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = [
          [32m+[0m[0m {
              [32m+[0m[0m carrier_gateway_id         = ""
              [32m+[0m[0m cidr_block                 = "0.0.0.0/0"
              [32m+[0m[0m core_network_arn           = ""
              [32m+[0m[0m destination_prefix_list_id = ""
              [32m+[0m[0m egress_only_gateway_id     = ""
              [32m+[0m[0m gateway_id                 = ""
              [32m+[0m[0m ipv6_cidr_block            = ""
              [32m+[0m[0m local_gateway_id           = ""
              [32m+[0m[0m nat_gateway_id             = (known after apply)
              [32m+[0m[0m network_interface_id       = ""
              [32m+[0m[0m transit_gateway_id         = ""
              [32m+[0m[0m vpc_endpoint_id            = ""
              [32m+[0m[0m vpc_peering_connection_id  = ""
            },
        ]
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-private-rt"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-private-rt"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.networking.aws_route_table.public[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = [
          [32m+[0m[0m {
              [32m+[0m[0m carrier_gateway_id         = ""
              [32m+[0m[0m cidr_block                 = "0.0.0.0/0"
              [32m+[0m[0m core_network_arn           = ""
              [32m+[0m[0m destination_prefix_list_id = ""
              [32m+[0m[0m egress_only_gateway_id     = ""
              [32m+[0m[0m gateway_id                 = (known after apply)
              [32m+[0m[0m ipv6_cidr_block            = ""
              [32m+[0m[0m local_gateway_id           = ""
              [32m+[0m[0m nat_gateway_id             = ""
              [32m+[0m[0m network_interface_id       = ""
              [32m+[0m[0m transit_gateway_id         = ""
              [32m+[0m[0m vpc_endpoint_id            = ""
              [32m+[0m[0m vpc_peering_connection_id  = ""
            },
        ]
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-public-rt"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-public-rt"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.private[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.networking.aws_subnet.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.10.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-private-1"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-private-1"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.networking.aws_subnet.private[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-2b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.11.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-private-2"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-private-2"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.networking.aws_subnet.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-public-1"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-public-1"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.networking.aws_subnet.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-2b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.2.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-public-2"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-public-2"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.networking.aws_vpc.main[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "main" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-vpc"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "tf-playground-staging-vpc"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
    }

[1m  # module.secrets.aws_kms_alias.secrets[0][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_alias" "secrets" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m name           = (known after apply)
      [32m+[0m[0m name_prefix    = (known after apply)
      [32m+[0m[0m target_key_arn = (known after apply)
      [32m+[0m[0m target_key_id  = (known after apply)
    }

[1m  # module.secrets.aws_kms_key.secrets[0][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_key" "secrets" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      [32m+[0m[0m deletion_window_in_days            = 7
      [32m+[0m[0m description                        = "KMS key for staging secrets encryption"
      [32m+[0m[0m enable_key_rotation                = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m is_enabled                         = true
      [32m+[0m[0m key_id                             = (known after apply)
      [32m+[0m[0m key_usage                          = "ENCRYPT_DECRYPT"
      [32m+[0m[0m multi_region                       = (known after apply)
      [32m+[0m[0m policy                             = (known after apply)
      [32m+[0m[0m rotation_period_in_days            = (known after apply)
      [32m+[0m[0m tags                               = (known after apply)
      [32m+[0m[0m tags_all                           = (known after apply)
    }

[1m  # module.secrets.aws_secretsmanager_secret.db_credentials[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret" "db_credentials" {
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m description                    = "Database credentials for staging environment"
      [32m+[0m[0m force_overwrite_replica_secret = false
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m kms_key_id                     = (known after apply)
      [32m+[0m[0m name                           = (known after apply)
      [32m+[0m[0m name_prefix                    = (known after apply)
      [32m+[0m[0m policy                         = (known after apply)
      [32m+[0m[0m recovery_window_in_days        = 30
      [32m+[0m[0m tags                           = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)
    }

[1m  # module.secrets.aws_secretsmanager_secret_version.db_credentials[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "db_credentials" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = (known after apply)
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = (known after apply)
    }

[1m  # module.secrets.random_password.db_password[0][0m will be created
[0m  [32m+[0m[0m resource "random_password" "db_password" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 16
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = true
      [32m+[0m[0m upper       = true
    }

[1m  # module.secrets.random_string.suffix[0][0m will be created
[0m  [32m+[0m[0m resource "random_string" "suffix" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 4
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.ssm.aws_iam_policy.ssm_automation[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "ssm_automation" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m description      = "Policy for SSM automation execution"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "staging-ssm-automation-policy"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-ssm-automation-policy"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-ssm-automation-policy"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
    }

[1m  # module.ssm.aws_iam_role.ssm_automation[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "ssm_automation" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ssm.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "staging-ssm-automation-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-ssm-automation-role"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-ssm-automation-role"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.ssm.aws_iam_role_policy_attachment.ssm_automation[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ssm_automation" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "staging-ssm-automation-role"
    }

[1m  # module.ssm.aws_ssm_document.database_automation[0m will be created
[0m  [32m+[0m[0m resource "aws_ssm_document" "database_automation" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m content          = <<-EOT
            schemaVersion: '0.3'
            assumeRole: '{{ AutomationAssumeRole }}'
            description: 'Automate database initialization with schema and sample data'
            parameters:
              DatabaseEndpoint:
                type: String
                description: RDS database endpoint
              DatabaseName:
                type: String
                description: Database name
              DatabaseUsername:
                type: String
                description: Database username
              DatabasePassword:
                type: String
                description: Database password
              InstanceId:
                type: String
                description: EC2 instance ID to run commands on
              AutomationAssumeRole:
                type: String
                description: IAM role ARN for automation execution
            mainSteps:
            - name: installDependencies
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Update system packages
                    yum update -y
                    
                    # Install MariaDB client if not already installed
                    if ! command -v mysql &> /dev/null; then
                        yum install -y mariadb1011-client-utils
                    fi
                    
                    echo "Dependencies installed successfully"
            - name: createDatabaseSchema
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Create database schema using environment variables
                    mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" << 'EOF'
                    CREATE TABLE IF NOT EXISTS contacts (
                        id INT AUTO_INCREMENT PRIMARY KEY,
                        name VARCHAR(100) NOT NULL,
                        email VARCHAR(100) UNIQUE NOT NULL,
                        phone VARCHAR(20),
                        created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
                    );
                    EOF
                    
                    echo "Database schema created successfully"
            - name: insertSampleData
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Insert sample data using environment variables
                    mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" << 'EOF'
                    INSERT IGNORE INTO contacts (name, email, phone) VALUES
                    ('John Doe', 'john.doe@example.com', '+1-555-0101'),
                    ('Jane Smith', 'jane.smith@example.com', '+1-555-0102'),
                    ('Bob Johnson', 'bob.johnson@example.com', '+1-555-0103'),
                    ('Alice Brown', 'alice.brown@example.com', '+1-555-0104'),
                    ('Charlie Wilson', 'charlie.wilson@example.com', '+1-555-0105');
                    EOF
                    
                    echo "Sample data inserted successfully"
            - name: verifyDatabaseSetup
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Verify the setup using environment variables
                    COUNT=$(mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" -s -N -e "SELECT COUNT(*) FROM contacts;")
                    echo "Database setup complete. Found $COUNT contacts in the database."
        EOT
      [32m+[0m[0m created_date     = (known after apply)
      [32m+[0m[0m default_version  = (known after apply)
      [32m+[0m[0m description      = (known after apply)
      [32m+[0m[0m document_format  = "YAML"
      [32m+[0m[0m document_type    = "Automation"
      [32m+[0m[0m document_version = (known after apply)
      [32m+[0m[0m hash             = (known after apply)
      [32m+[0m[0m hash_type        = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m latest_version   = (known after apply)
      [32m+[0m[0m name             = "staging-database-automation"
      [32m+[0m[0m owner            = (known after apply)
      [32m+[0m[0m parameter        = (known after apply)
      [32m+[0m[0m platform_types   = (known after apply)
      [32m+[0m[0m schema_version   = (known after apply)
      [32m+[0m[0m status           = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-database-automation-doc"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-database-automation-doc"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
    }

[1m  # module.webserver.data.template_file.user_data[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "template_file" "user_data" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m rendered = (known after apply)
      [32m+[0m[0m template = <<-EOT
            #!/bin/bash
            
            # Update system packages
            yum update -y
            
            # Install required packages
            yum install -y python3 python3-pip git mariadb1011-client-utils
            
            # Create application directory
            mkdir -p /var/www/webapp
            cd /var/www/webapp
            
            # Create Python virtual environment
            python3 -m venv venv
            source venv/bin/activate
            
            # Install required Python packages
            pip install flask mysql-connector-python
            
            # Create application files
            cat > app.py << 'EOF'
            from flask import Flask, jsonify
            import mysql.connector
            import os
            
            app = Flask(__name__)
            
            # Database configuration
            db_config = {
                'host': '${db_host}',
                'user': '${db_user}',
                'password': '${db_password}',
                'database': '${db_name}'
            }
            
            def get_db_connection():
                return mysql.connector.connect(**db_config)
            
            @app.route('/')
            def index():
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor(dictionary=True)
                    cursor.execute('SELECT * FROM contacts')
                    contacts = cursor.fetchall()
                    cursor.close()
                    conn.close()
                    return jsonify(contacts)
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            @app.route('/health')
            def health():
                return jsonify({'status': 'healthy'})
            
            if __name__ == '__main__':
                app.run(host='0.0.0.0', port=8080)
            EOF
            
            # Create systemd service file
            cat > /etc/systemd/system/webapp.service << 'EOF'
            [Unit]
            Description=Python Web Application
            After=network.target
            
            [Service]
            User=root
            WorkingDirectory=/var/www/webapp
            Environment="PATH=/var/www/webapp/venv/bin"
            ExecStart=/var/www/webapp/venv/bin/python app.py
            Restart=always
            
            [Install]
            WantedBy=multi-user.target
            EOF
            
            # Start and enable the service
            systemctl daemon-reload
            systemctl start webapp
            systemctl enable webapp
        EOT
      [32m+[0m[0m vars     = {
          [32m+[0m[0m "db_host"     = (known after apply)
          [32m+[0m[0m "db_name"     = "tfplayground"
          [32m+[0m[0m "db_password" = (sensitive value)
          [32m+[0m[0m "db_user"     = (sensitive value)
        }
    }

[1m  # module.webserver.aws_eip.webserver[0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "webserver" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = "vpc"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m ipam_pool_id         = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m ptr_record           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Name" = "staging-webserver-eip"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-webserver-eip"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # module.webserver.aws_iam_instance_profile.webserver[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "webserver" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "staging-webserver-profile"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = "staging-webserver-role"
      [32m+[0m[0m tags_all    = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # module.webserver.aws_iam_policy.webserver_rds[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "webserver_rds" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m description      = "Policy to allow webserver to interact with RDS database"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "staging-webserver-rds-policy"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "rds-db:connect",
                          [32m+[0m[0m "rds:DescribeDBInstances",
                          [32m+[0m[0m "rds:DescribeDBClusters",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:rds:us-east-2:123324351829:db:staging-*",
                          [32m+[0m[0m "arn:aws:rds-db:us-east-2:123324351829:dbuser:staging-*/*",
                        ]
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name" = "staging-webserver-rds-policy"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-webserver-rds-policy"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
    }

[1m  # module.webserver.aws_iam_policy.webserver_secrets[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "webserver_secrets" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m description      = "Policy to allow webserver to access database credentials in Secrets Manager"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "staging-webserver-secrets-policy"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "secretsmanager:GetSecretValue",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/staging/database/credentials-*",
                        ]
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "kms:Decrypt",
                          [32m+[0m[0m "kms:DescribeKey",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:kms:us-east-2:123324351829:key/*",
                        ]
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name" = "staging-webserver-secrets-policy"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-webserver-secrets-policy"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
    }

[1m  # module.webserver.aws_iam_role.webserver[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "webserver" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "staging-webserver-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Name" = "staging-webserver-role"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-webserver-role"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.webserver.aws_iam_role_policy_attachment.webserver_rds[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "webserver_rds" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "staging-webserver-role"
    }

[1m  # module.webserver.aws_iam_role_policy_attachment.webserver_secrets[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "webserver_secrets" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "staging-webserver-role"
    }

[1m  # module.webserver.aws_iam_role_policy_attachment.webserver_ssm[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "webserver_ssm" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      [32m+[0m[0m role       = "staging-webserver-role"
    }

[1m  # module.webserver.aws_instance.webserver[0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "webserver" {
      [32m+[0m[0m ami                                  = "ami-06c8f2ec674c67112"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = (known after apply)
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = "staging-webserver-profile"
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t3.small"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "tf-playground-key"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "staging-webserver"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-webserver"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)

      [32m+[0m[0m root_block_device {
          [32m+[0m[0m delete_on_termination = true
          [32m+[0m[0m device_name           = (known after apply)
          [32m+[0m[0m encrypted             = true
          [32m+[0m[0m iops                  = (known after apply)
          [32m+[0m[0m kms_key_id            = (known after apply)
          [32m+[0m[0m tags_all              = (known after apply)
          [32m+[0m[0m throughput            = (known after apply)
          [32m+[0m[0m volume_id             = (known after apply)
          [32m+[0m[0m volume_size           = 20
          [32m+[0m[0m volume_type           = "gp3"
        }
    }

[1m  # module.webserver.aws_key_pair.webserver[0m will be created
[0m  [32m+[0m[0m resource "aws_key_pair" "webserver" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m fingerprint     = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m key_name        = "tf-playground-key"
      [32m+[0m[0m key_name_prefix = (known after apply)
      [32m+[0m[0m key_pair_id     = (known after apply)
      [32m+[0m[0m key_type        = (known after apply)
      [32m+[0m[0m public_key      = (known after apply)
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
    }

[1m  # module.webserver.aws_security_group.webserver[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "webserver" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Security group for web server"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "Allow all outbound traffic"
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "Allow HTTP traffic on port 8080"
              [32m+[0m[0m from_port        = 8080
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 8080
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "SSH access"
              [32m+[0m[0m from_port        = 22
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 22
            },
        ]
      [32m+[0m[0m name                   = "staging-webserver-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name" = "staging-webserver-sg"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "ManagedBy"   = "terraform"
          [32m+[0m[0m "Name"        = "staging-webserver-sg"
          [32m+[0m[0m "Project"     = "tf-playground"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.webserver.tls_private_key.webserver[0m will be created
[0m  [32m+[0m[0m resource "tls_private_key" "webserver" {
      [32m+[0m[0m algorithm                     = "RSA"
      [32m+[0m[0m ecdsa_curve                   = "P224"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m private_key_openssh           = (sensitive value)
      [32m+[0m[0m private_key_pem               = (sensitive value)
      [32m+[0m[0m private_key_pem_pkcs8         = (sensitive value)
      [32m+[0m[0m public_key_fingerprint_md5    = (known after apply)
      [32m+[0m[0m public_key_fingerprint_sha256 = (known after apply)
      [32m+[0m[0m public_key_openssh            = (known after apply)
      [32m+[0m[0m public_key_pem                = (known after apply)
      [32m+[0m[0m rsa_bits                      = 4096
    }

[1mPlan:[0m 39 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m database_endpoint            = (known after apply)
  [32m+[0m[0m database_name                = "tfplayground"
  [32m+[0m[0m private_subnet_ids           = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m public_subnet_ids            = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m random_suffix                = (known after apply)
  [32m+[0m[0m ssm_automation_document_name = "staging-database-automation"
  [32m+[0m[0m ssm_automation_role_arn      = (known after apply)
  [32m+[0m[0m vpc_id                       = (known after apply)
  [32m+[0m[0m webserver_instance_id        = (known after apply)
  [32m+[0m[0m webserver_public_ip          = (known after apply)

  ```
  
  </details>